###  Part # 1
  #### Terraform Format and Style 🖌``
  #### Terraform Initialization ⚙️``
  #### Terraform Plan 📖``
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/8d142d9b-c6a6-4cd7-b304-07a59455ded2/terraform-bin show -no-color network.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.network.module.arch.aws_eip.natip will be created
  + resource "aws_eip" "natip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-natip"
          + "Owner" = "Haojie Fu"
        }
      + tags_all             = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-natip"
          + "Owner" = "Haojie Fu"
        }
      + vpc                  = true
    }

  # module.network.module.arch.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-igw"
          + "Owner" = "Haojie Fu"
        }
      + tags_all = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-igw"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.module.arch.aws_nat_gateway.natgw will be created
  + resource "aws_nat_gateway" "natgw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-natgw"
          + "Owner" = "Haojie Fu"
        }
      + tags_all                           = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-natgw"
          + "Owner" = "Haojie Fu"
        }
    }

  # module.network.module.arch.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-private-rt"
          + "Owner" = "Haojie Fu"
        }
      + tags_all         = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-private-rt"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.arch.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-rt"
          + "Owner" = "Haojie Fu"
        }
      + tags_all         = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-rt"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.arch.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.arch.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.arch.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.arch.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.arch.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.arch.aws_route_table_association.public[3] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.arch.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-private-subnet-0"
          + "Owner" = "Haojie Fu"
        }
      + tags_all                                       = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-private-subnet-0"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.arch.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-private-subnet-1"
          + "Owner" = "Haojie Fu"
        }
      + tags_all                                       = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-private-subnet-1"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.arch.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-subnet-0"
          + "Owner" = "Haojie Fu"
        }
      + tags_all                                       = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-subnet-0"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.arch.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-subnet-1"
          + "Owner" = "Haojie Fu"
        }
      + tags_all                                       = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-subnet-1"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.arch.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-subnet-2"
          + "Owner" = "Haojie Fu"
        }
      + tags_all                                       = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-subnet-2"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.arch.aws_subnet.public[3] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-subnet-3"
          + "Owner" = "Haojie Fu"
        }
      + tags_all                                       = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-public-subnet-3"
          + "Owner" = "Haojie Fu"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.arch.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.3.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-vpc"
          + "Owner" = "Haojie Fu"
        }
      + tags_all                             = {
          + "App"   = "ACS730 Project"
          + "Env"   = "prod"
          + "Name"  = "ACS730-prod-vpc"
          + "Owner" = "Haojie Fu"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + igw_id               = (known after apply)
  + natgw_id             = (known after apply)
  + private_subnet_cidrs = [
      + "10.3.5.0/24",
      + "10.3.6.0/24",
    ]
  + private_subnet_ids   = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_cidrs  = [
      + "10.3.1.0/24",
      + "10.3.2.0/24",
      + "10.3.3.0/24",
      + "10.3.4.0/24",
    ]
  + public_subnet_ids    = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr             = "10.3.0.0/16"
  + vpc_id               = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.network.module.arch.aws_eip.natip will be created%0A  + resource "aws_eip" "natip" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-natip"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all             = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-natip"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # module.network.module.arch.aws_internet_gateway.igw will be created%0A  + resource "aws_internet_gateway" "igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-igw"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-igw"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_nat_gateway.natgw will be created%0A  + resource "aws_nat_gateway" "natgw" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-natgw"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all                           = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-natgw"%0A          + "Owner" = "Haojie Fu"%0A        }%0A    }%0A%0A  # module.network.module.arch.aws_route_table.private will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = (known after apply)%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-private-rt"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all         = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-private-rt"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_route_table.public will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-rt"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all         = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-rt"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_route_table_association.public[2] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_route_table_association.public[3] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.3.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-private-subnet-0"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-private-subnet-0"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.3.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-private-subnet-1"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-private-subnet-1"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.3.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-subnet-0"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-subnet-0"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.3.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-subnet-1"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-subnet-1"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_subnet.public[2] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.3.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-subnet-2"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-subnet-2"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_subnet.public[3] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1d"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.3.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-subnet-3"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-public-subnet-3"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.module.arch.aws_vpc.vpc will be created%0A  + resource "aws_vpc" "vpc" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.3.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = (known after apply)%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-vpc"%0A          + "Owner" = "Haojie Fu"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "ACS730 Project"%0A          + "Env"   = "prod"%0A          + "Name"  = "ACS730-prod-vpc"%0A          + "Owner" = "Haojie Fu"%0A        }%0A    }%0A%0APlan: 18 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + igw_id               = (known after apply)%0A  + natgw_id             = (known after apply)%0A  + private_subnet_cidrs = [%0A      + "10.3.5.0/24",%0A      + "10.3.6.0/24",%0A    ]%0A  + private_subnet_ids   = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + public_subnet_cidrs  = [%0A      + "10.3.1.0/24",%0A      + "10.3.2.0/24",%0A      + "10.3.3.0/24",%0A      + "10.3.4.0/24",%0A    ]%0A  + public_subnet_ids    = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + vpc_cidr             = "10.3.0.0/16"%0A  + vpc_id               = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @gilfoylegpt, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Production`*